# GetLoadClassifications Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PanelScheduleData..::..GetLoadClassifications Method
PanelScheduleData Class See Also
---
Gets an array of the load classifications associated with this panel schedule
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public IList<ElementId> GetLoadClassifications()
```

Visual Basic
---
```text
Public Function GetLoadClassifications As IList(Of ElementId)
```

Visual C++
---
```text
public:
IList<ElementId^>^ GetLoadClassifications()
```

# ### Return Value
The array of the load classifications
# See Also
PanelScheduleData Class
Autodesk.Revit.DB.Electrical Namespace